# <center> Pandas Merging & Joining Data </center>

- [Simple Joining with Concat Function](#section_1)
- [Complex Joining with Merge Function](#section_2)

<hr>

### Pandas Merging & Joining Data <a class="anchor" id="section_0"></a>

One of the common tasks for any data professionals is to collect and aggregate multiple data sources. Very often, these data sources are stored separately at different database systems and possibly different locations. The advantage of the aggregation process is to allow us to further our analysis and extract meaningful insights.

For instance, let's say you are working on a project to analyze the impact of a sports game on food and beverage sales. 

Typically, you will need different datasets such as sports game timetable, sports team performance, sport venues as well as sales revenue from different vendors. In real-life, these datasets are likely stored at different sources, some online and some on your local computer.

In this section, we will learn the two most common ways to combine DataFrames in the Pandas library:

* **pd.concat([DataFrame1, DataFrame2]): Simple combining two or more Pandas dataframes in a column-wise or row-wise approach.**

* **pd.merge([DataFrame1, DataFrame2]): Complex column-wise combining of Pandas dataframes in a SQL-like way.**

### Simple Joining with Concat Function <a class="anchor" id="section_1"></a>

The [concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html) function is used to add together one or more DataFrames. To demonstrate how it works, we will use the function to combine multiple toy DataFrames about popular sports tournaments like FIFA Soccer World Cup and Rugby World Cup. Each dataset has different pieces of information such as winning team, host country, attendance size as shown in the code below:

In [1]:
# Import pandas
import pandas as pd

In [2]:
# Create a dataframe about FIFA World Cup Winning Teams. Refer to lesson video for details.
df_fifa_world_cup_winners = pd.DataFrame({'year': [2018,2014,2010,2006,2002,1998],
                                          'winner': ['France','Germany','Spain','Italy','Brazil','France'],
                                          'host_country': ['Russia','Brazil','South Africa',
                                                           'Germany','South Korea','Japan']})

# Display DataFrame
df_fifa_world_cup_winners

   year   winner  host_country
0  2018   France        Russia
1  2014  Germany        Brazil
2  2010    Spain  South Africa
3  2006    Italy       Germany
4  2002   Brazil   South Korea
5  1998   France         Japan

And in the same way, we create the rugby world cup tournament dataset.

In [3]:
# Create a dataframe about Rugby World Cup Winning Teams. Refer to lesson video for details.
df_rugby_world_cup_winners = pd.DataFrame({'year': [1999,2003,2007,2011,2015,2019],
                                           'winner': ['Australia','England','South Africa','New Zealand','New Zealand','South Africa'],
                                           'host_country': ['Wales','Australia','France','New Zealand','England','Japan'],
                                           'venue':['Millennium Stadium','Telstra Stadium','Stade de France','Eden Park','Twickenham','Nissan Stadium'],
                                           'attendance':[72500,82957,80430,61079,80125,70103]})

# Display DataFrame
df_rugby_world_cup_winners

   year        winner host_country               venue  attendance
0  1999     Australia        Wales  Millennium Stadium       72500
1  2003       England    Australia     Telstra Stadium       82957
2  2007  South Africa       France     Stade de France       80430
3  2011   New Zealand  New Zealand           Eden Park       61079
4  2015   New Zealand      England          Twickenham       80125
5  2019  South Africa        Japan      Nissan Stadium       70103

We first noticed the DataFrames above have some common information such as the year of the event, the winning team name, and the host country. However, the Rugby World Cup dataset has two extra columns: venue and attendance.

Let's try to create a large dataset with all winning FIFA and Rugby world cup teams. The code below demonstrates how to use all the common column names to stack the two DataFrames on top of each other.

In [4]:
# Join the 2 DataFrames using the concat() method
df_teams = pd.concat([df_fifa_world_cup_winners[['year', 'winner', 'host_country']],
                     df_rugby_world_cup_winners[['year', 'winner', 'host_country']]])

# Display the DataFrame
df_teams

   year        winner  host_country
0  2018        France        Russia
1  2014       Germany        Brazil
2  2010         Spain  South Africa
3  2006         Italy       Germany
4  2002        Brazil   South Korea
5  1998        France         Japan
0  1999     Australia         Wales
1  2003       England     Australia
2  2007  South Africa        France
3  2011   New Zealand   New Zealand
4  2015   New Zealand       England
5  2019  South Africa         Japan

We created a new DataFrame object called `df_teams` with 12 records from the two parent datasets. However, the resulting DataFrame raises some issues. 

- First, it becomes impossible to identify if a given team was part of the original Rugby or Soccer datasets;
- Second, the new DataFrame object inherits the original index values from the parent datasets. This behaviour can be controlled by adjusting the [concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html) function parameters. The keys parameter can be used to track the data source by adding extra index values to the new DataFrame as shown in the example below. This feature would allow us to query and access specific subsets of the DataFrame using the newly assigned index value.

The good thing is, we can fix these issues by changing some of the parameters in the [concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html) function. The parameter `keys` is used to highlight the source of the DataFrame, so we will be able to know which of these records belong to the rugby world cup or the fifa world cup.

In [5]:
# Add data source index values to the new DataFrame
df_teams = pd.concat([df_fifa_world_cup_winners[['year', 'winner', 'host_country']],
                     df_rugby_world_cup_winners[['year', 'winner', 'host_country']]], 
                     keys = ['soccer', 'rugby'])

# Display the DataFrame
df_teams

          year        winner  host_country
soccer 0  2018        France        Russia
       1  2014       Germany        Brazil
       2  2010         Spain  South Africa
       3  2006         Italy       Germany
       4  2002        Brazil   South Korea
       5  1998        France         Japan
rugby  0  1999     Australia         Wales
       1  2003       England     Australia
       2  2007  South Africa        France
       3  2011   New Zealand   New Zealand
       4  2015   New Zealand       England
       5  2019  South Africa         Japan

As you can see, the parameter takes a list of values to be added to the DataFrame index. This part is now called a multi-level index value which is something we will be learning more in future lessons.

From the result, we can see very clearly which records belong to the rugby or fifa world cup.

In another scenario, we may prefer the new DataFrame to have totally new index values. This option can be achieved by setting the `ignore_index` parameter to `True` as shown in the code below:

In [6]:
# Ignore old index values in the new DataFrame
df_teams = pd.concat([df_fifa_world_cup_winners[['year', 'winner', 'host_country']],
                     df_rugby_world_cup_winners[['year', 'winner', 'host_country']]], 
                     ignore_index = True)

# Display the DataFrame
df_teams

    year        winner  host_country
0   2018        France        Russia
1   2014       Germany        Brazil
2   2010         Spain  South Africa
3   2006         Italy       Germany
4   2002        Brazil   South Korea
5   1998        France         Japan
6   1999     Australia         Wales
7   2003       England     Australia
8   2007  South Africa        France
9   2011   New Zealand   New Zealand
10  2015   New Zealand       England
11  2019  South Africa         Japan

The [concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html) function also allows us to combine multiple datasets even with little or no common values among them. The newly generated dataset will include all columns from the original DataFrame, with missing values replaced with `null` or `NaN` as shown in the example below.

In [7]:
# Concat two DataFrames to include all original columns
df_teams = pd.concat([df_fifa_world_cup_winners,
                     df_rugby_world_cup_winners])

# Display the DataFrame
df_teams

   year        winner  host_country               venue  attendance
0  2018        France        Russia                 NaN         NaN
1  2014       Germany        Brazil                 NaN         NaN
2  2010         Spain  South Africa                 NaN         NaN
3  2006         Italy       Germany                 NaN         NaN
4  2002        Brazil   South Korea                 NaN         NaN
5  1998        France         Japan                 NaN         NaN
0  1999     Australia         Wales  Millennium Stadium     72500.0
1  2003       England     Australia     Telstra Stadium     82957.0
2  2007  South Africa        France     Stade de France     80430.0
3  2011   New Zealand   New Zealand           Eden Park     61079.0
4  2015   New Zealand       England          Twickenham     80125.0
5  2019  South Africa         Japan      Nissan Stadium     70103.0

The examples above demonstrate how the Pandas [concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html) function can create new datasets by adding DataFrame objects on top of each other (row axis). The function also provides the possibility to add the DataFrames sideways (column axis). This option is controlled using the axis parameter when it's set to 0 or 1 as shown in the example below:

In [8]:
# oncat two DataFrames to include all original columns aligned horizontally
df_teams = pd.concat([df_fifa_world_cup_winners,
                     df_rugby_world_cup_winners], axis = 1)

# Display the DataFrame
df_teams

,year,winner,host_country,year,winner,host_country,venue,attendance
0,2018,France,Russia,1999,Australia,Wales,Millennium Stadium,72500
1,2014,Germany,Brazil,2003,England,Australia,Telstra Stadium,82957
2,2010,Spain,South Africa,2007,South Africa,France,Stade de France,80430
3,2006,Italy,Germany,2011,New Zealand,New Zealand,Eden Park,61079
4,2002,Brazil,South Korea,2015,New Zealand,England,Twickenham,80125
5,1998,France,Japan,2019,South Africa,Japan,Nissan Stadium,70103

<br>
<br>

### Complex Joining with Merge Function <a class="anchor" id="section_2"></a>

Pandas [merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) provides the functionality to join DataFrame and Series objects in a way similar to relational database operations. Users who are familiar with merging datasets using SQL may find the merge function easy to use. 

You will notice that there is a focus on the use of key values and how similar values on both sides help to decide how to merge the datasets.

As usual, letâ€™s create some dummy data sets to practice with. The first dataset is called departments and it consists of three columns and four rows while the second dataset is called employees with three columns and five rows.

In [9]:
# Create employees dataset
df_departments = pd.DataFrame(
    {'department_id':['D1','D2','D3','D4'],
     'department_name':['IT','SALES','HR','R&D'],
     'department_location':['location_1','location_1','location_2','location_2']})

# Create departments dataset
df_employees = pd.DataFrame(
    {'employee_name':['Michael','Alice','Max','Janet','Ali'],
     'department_id':['D1','D1','D2','D3','D6'],
     'salary':[500,1000,1500,2000,2500]})

In [10]:
# Display df_departments 
df_departments

  department_id department_name department_location
0            D1              IT          location_1
1            D2           SALES          location_1
2            D3              HR          location_2
3            D4             R&D          location_2

In [11]:
# Display df_employees
df_employees

  employee_name department_id  salary
0       Michael            D1     500
1         Alice            D1    1000
2           Max            D2    1500
3         Janet            D3    2000
4           Ali            D6    2500

We notice the two datasets have different columns such as `department_name` and `department_location`, and `employee_name` and `salary`. 

However, we also notice a common column in both DataFrames called `department_id`. And inside that column there are some identical values in both datasets, such as `D1` and `D2`, as well as some different values such as `D4` that is only available in the departments dataset and `D6` that is only available in the employees dataset.

To join the two DataFrame objects using the  [merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) function, we can use a set of parameters to identify common values, joining type, and source object. 

* `on`: This parameter can be used if the common column has the same name in both DataFrames
* `left on`: Identify the joining column in the left DataFrame
* `right on`: identify the joining column in the right DataFrame
* `indicator`: Add an extra column to the joined DataFrame to show the source of each row
* `how`: Identify the joining type as one of four possible options [inner, left, right, outer]. 

The following code will merge the two tables using the key column and the default inner joining method.

In [12]:
# Merge the two DataFrames using the common column

df_results = pd.merge(df_employees, df_departments,  
                      on='department_id', how = 'inner',
                      indicator = True)

# Display the dataset
df_results

,employee_name,department_id,salary,department_name,department_location,_merge
0,Michael,D1,500,IT,location_1,both
1,Alice,D1,1000,IT,location_1,both
2,Max,D2,1500,SALES,location_1,both
3,Janet,D3,2000,HR,location_2,both

From the result, we can see only 4 rows were selected above. These are the records with the `department_id` values `D1`, `D2`, `D3` and originally appeared on both the left and right datasets. This is essentially how the SQL inner join works. 

We also notice how the indicator parameter gives us the source of the records. That means these 4 records appear on both sides of the joining DataFrames.

Now let's try to change the `how` parameter from the default "inner" to "outer" join to see what's the difference, and we can check if we can get all the records in our datasets.

In [13]:
# Merge the two DataFrames using outer join

df_results = pd.merge(df_employees, df_departments, 
                      on='department_id', 
                      indicator = True, how = 'outer')

# Display the dataset
df_results

,employee_name,department_id,salary,department_name,department_location,_merge
0,Michael,D1,500.0,IT,location_1,both
1,Alice,D1,1000.0,IT,location_1,both
2,Max,D2,1500.0,SALES,location_1,both
3,Janet,D3,2000.0,HR,location_2,both
4,Ali,D6,2500.0,NaN,NaN,left_only
5,NaN,D4,NaN,R&D,location_2,right_only

Here we see we joined both the common and non-common values of the records. 

The records with (`D1` to `D3`) appear to be coming from both original datasets while `D4` record appears only from the right â€œdepartmentsâ€ dataset, and don't have any values for `employee_name`, while `D6` appears from the left â€œemployeesâ€ dataset and doesn't have any value for `department_name`.

Now you can try to practice some of these parameters on your own by changing the indicator from true to false and other joining options to learn the ins and outs of the merge function. 

These two functions [merge()](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html) and [concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html)  represent the most commonly used methods to join data sets in the pandas library.